// Билет № 24, задача № 2
#include <iostream>
using namespace std;
int main() {
    int n, p, o, i;
    p = 0;
    o = 0;
    i = 0;
    n = 0;
    int a[5] = {-1, -2, -3, 0, 5};
    while (n < 5) {
        if (a[n] > 0) {
            p += 1;
        }
        if (a[n] == 0) {
            i += 1;
        }
        if (a[n] < 0) {
            o += 1;
        }
        n += 1;
    }
    cout << "Количество положительных чисел: " <<  p << "\n";
    cout << "Количество чисел, равных 0: " <<  i << "\n";
    cout << "Количество отрицательных чисел: " <<  o << "\n";
}